{
    "header": {
        "welcome-message": "Buscador de tonalidad de canciones y más. Por productores, para productores...",
        "home-btn": "Ir a inicio",
        "tools-btn" : "Herramientas avanzadas",
        "bottom-menu": {
            "tutorial": "Tutorial",
            "about": "Proyecto",
            "contacto": "Contacto"
        },
        "tutorial": {
            "encabezado": "Herramientas avanzadas",
            "artistmatchfinder": {
                "descripcion": "Introduce dos artistas y obtén una lista de parejas de canciones compuestas en la misma escala y al mismo tempo."
            },
            "songmatchfinder": {
                "descripcion": "Introduce una canción y un artista para encontrar canciones de ese artista compuestas en la misma escala que la canción introducida."
            },
            "artistkeyfinder": {
                "descripcion": "Obtén las canciones de un artista compuestas en la escala que elijas."
            },
            "songkeyfinder": {
                "descripcion": "Busca una canción para obtener su escala y tempo."
            },
            "prueba": "Prueba"
        },
        "proyecto": {
            "encabezado": "Sobre el proyecto",
            "idea": {
                "titulo": "Idea original",
                "texto": "La idea de este proyecto surge tras descubrir las posibilidades que ofrece el API de Spotify y como un reto personal para mi.",
                "texto2": "Empecé el desarrollo de Lemonade con Javascript puro, pero rápidamente me di cuenta de que una aplicación de estas características requería de alguna librería o framework para que fuera viable y más sostenible. Por eso aprendí React y me puse manos a la obra."
            },
            "desarrollo": {
                "titulo": "Desarrollo",
                "texto": "El desarrollo comenzó durante los meses de abril y mayo del 2022 durante mi estancia en Polonia, como un proyecto personal y como anexo a mi proyecto final del grado superior de Desarrollo de Aplicaciones Web. En el presente sigo realizando pequeñas mejoras y añadiendo nuevas funcionalidades."
            },
            "futuro": {
                "titulo": "Líneas de desarrollo futuras",
                "texto": "Se pretende codificar un backend que permita a los usuarios registrarse y poder guardar ciertas búsquedas, así como crear una base de datos con información sobre canciones que no se encuentran en Spotify."
            }
        },
        "contacto": {
            "encabezado": "Contacto",
            "ig": "¡Siguenos en Instagram!",
            "git": "¡Código en Github!"
        }
    },
    "tools": {
        "loading": "Cargando...",
        "loading-songs": "Obteniendo canciones...",
        "preparing-result": "Preparando resultados...",
        "button-text": "Buscar",
        "artist-placeholder": "Introduce artista...",
        "artist": "Artista",
        "song": "Canción",
        "scale": "Escala",
        "spotify-text":"Ver en Spotify",
        "results": "Resultados",
        "intro-artist": "Introduce un artista",
        "intro-song": "Introduce una canción",
        "intro-scale": "Elige una escala",
        "next-page": "Siguiente página",
        "prev-page": "Pagina anterior",
        "first-artist": "Introduce el primer artista",
        "second-artist": "Introduce segundo artista",
        "texto-error-resultados-1":"Prueba a introducir más información como el nombre completo o el artista.",
        "texto-error-resultados-2":"Si aún así no aparece, es probable que la canción que buscas no esté en Spotify y por eso no podemos ofrecer la información."
    },
    "footer": {
        "lemon-icon": "Icono del Limón en Iconscout",
        "github-icon": "Icono github creado por Dave Gandy - Flaticon"
    }
}